app/Models/BrandModel.php

SELECT *
FROM `brand_details`
WHERE `is_delete` = 0
ORDER BY `brand_id` DESC
---
	function BrandDetails(){
		return $this->db->table('brand_details')->where('is_delete',0)->orderBy("brand_id","DESC")->get()->getResultArray();