app/Models/CategoryModel.php

SELECT *
FROM `category_details` `cat`
JOIN `brand_details` AS `brand` ON `cat`.`brandId` = `brand`.`brand_id`
ORDER BY `cat_id` DESC
---
	function CategoryDetails(){

		  return $this

                    ->db

                    ->table('category_details cat')

                    ->select()

                    ->join('brand_details AS brand','cat.brandId = brand.brand_id')

                    ->orderBy('cat_id',"DESC")

                    ->get()