app/Models/HomeModel.php

SELECT *
FROM `brand_details`
WHERE `is_delete` = 0
ORDER BY `brand_id` DESC
---
function BrandDetails(){
		return $this->db->table('brand_details')->where('is_delete',0)->orderBy("brand_id","DESC")->get()->getResultArray();

SELECT *
FROM `category_details`
WHERE `brandId` = 3
ORDER BY `cat_id` DESC
---
	function getCategoryDetails($brandId){
		return $this->db->table('category_details')->where('brandId',$brandId)->orderBy("cat_id","DESC")->get()->getResultArray();

SELECT *
FROM `product_details`
WHERE `brand_id` = 6
AND `catId` = 29
ORDER BY `pro_id` DESC
---
	function getCategoryproductDetails($brandId,$catId){
		return $this->db->table('product_details')->where('brand_id',$brandId)->where('catId',$catId)->orderBy("pro_id ","DESC")->get()->getResultArray();

SELECT *
FROM `product_details`
WHERE `brand_id` = 3
ORDER BY `pro_id` DESC
---
	function getBrandProducts($brandId){
		return $this->db->table('product_details')->where('brand_id',$brandId)->orderBy("pro_id ","DESC")->get()->getResultArray();

SELECT *
FROM `product_details`
WHERE `pro_id` = 33
---
	function getproductDetails($proId){
		return $this->db->table('product_details')->where('pro_id',$proId)->get()->getRow();