app/Models/ProductModel.php

	function ProductDetails(){

		  return $this

                    ->db

                    ->table('product_details prod')

                    ->select()

                    ->join('category_details AS cat','cat.cat_id = prod.catId')

                     ->join('brand_details AS brand','brand.brand_id = prod.brand_id')

                    ->orderBy('pro_id',"DESC")

                    ->get()
---
SELECT *
FROM `product_details` `prod`
JOIN `category_details` AS `cat` ON `cat`.`cat_id` = `prod`.`catId`
JOIN `brand_details` AS `brand` ON `brand`.`brand_id` = `prod`.`brand_id`
ORDER BY `pro_id` DESC